; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v4 ?v12)
             (pred_1 ?v10 ?v6)
             (pred_12 ?v4 ?v6)
             (pred_5 ?v5 ?v4 )
	     (pred_4 ?v4)
             (pred_9 ?v9)
             (pred_11 ?v10)
             (pred_3 ?v6)
             (pred_10 ?v4)
             (pred_2 ?v10)
             (pred_6 ?v4)
             (pred_8 ))



(:action op_2
:parameters (?v2 ?v3 ?v13 ?v7)
:precondition (and (pred_9 ?v2) (pred_9 ?v3) (pred_11 ?v13) (pred_3 ?v7)
          (pred_7 ?v2 ?v3) (pred_1 ?v13 ?v7)
                   (pred_12 ?v3 ?v7) (pred_4 ?v2) 
                   (pred_10 ?v3) (pred_2 ?v13))
:effect (and  (pred_6 ?v3) (not (pred_10 ?v3))))


(:action op_5
:parameters (?v2 ?v8)
:precondition (and (pred_9 ?v2) (pred_9 ?v8)
               (pred_4 ?v2) (pred_7 ?v2 ?v8) (pred_6 ?v8))
:effect (and (pred_4 ?v8) (not (pred_4 ?v2))))

(:action op_3
:parameters (?v2 ?v13)
:precondition (and (pred_9 ?v2) (pred_11 ?v13) 
                  (pred_4 ?v2) (pred_5 ?v13 ?v2) (pred_8 ))
:effect (and (pred_2 ?v13)
   (not (pred_5 ?v13 ?v2)) (not (pred_8 ))))


(:action op_4
:parameters (?v2 ?v1 ?v11)
:precondition (and (pred_9 ?v2) (pred_11 ?v1) (pred_11 ?v11)
                  (pred_4 ?v2) (pred_2 ?v11) (pred_5 ?v1 ?v2))
:effect (and (pred_2 ?v1) (pred_5 ?v11 ?v2)
        (not (pred_2 ?v11)) (not (pred_5 ?v1 ?v2))))

(:action op_1
:parameters (?v2 ?v13)
:precondition (and (pred_9 ?v2) (pred_11 ?v13) 
                  (pred_4 ?v2) (pred_2 ?v13))
:effect (and (pred_8 ) (pred_5 ?v13 ?v2) (not (pred_2 ?v13)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_19 obj_15 obj_21 obj_16 obj_17 obj_10 obj_08 obj_11 obj_01 obj_02 obj_03 obj_18 obj_07 obj_12 obj_20
    obj_13 obj_09
    obj_06 obj_14 obj_05
    )

    (:init
       (pred_8)

       (pred_9 obj_04)
       (pred_9 obj_19)
       (pred_9 obj_15)
       (pred_9 obj_21)
       (pred_9 obj_16)
       (pred_9 obj_17)
       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_11)
       (pred_9 obj_01)
       (pred_9 obj_02)
       (pred_9 obj_03)
       (pred_9 obj_18)
       (pred_9 obj_07)
       (pred_9 obj_12)
       (pred_9 obj_20)
       (pred_3 obj_13)
       (pred_3 obj_09)
       (pred_11 obj_06)
       (pred_11 obj_14)
       (pred_11 obj_05)

       (pred_7 obj_04 obj_16)
       (pred_7 obj_04 obj_19)
       (pred_7 obj_19 obj_17)
       (pred_7 obj_19 obj_15)
       (pred_7 obj_19 obj_04)
       (pred_7 obj_15 obj_10)
       (pred_7 obj_15 obj_21)
       (pred_7 obj_15 obj_19)
       (pred_7 obj_21 obj_08)
       (pred_7 obj_21 obj_15)
       (pred_7 obj_16 obj_11)
       (pred_7 obj_16 obj_17)
       (pred_7 obj_16 obj_04)
       (pred_7 obj_17 obj_01)
       (pred_7 obj_17 obj_10)
       (pred_7 obj_17 obj_19)
       (pred_7 obj_17 obj_16)
       (pred_7 obj_10 obj_02)
       (pred_7 obj_10 obj_08)
       (pred_7 obj_10 obj_15)
       (pred_7 obj_10 obj_17)
       (pred_7 obj_08 obj_03)
       (pred_7 obj_08 obj_21)
       (pred_7 obj_08 obj_10)
       (pred_7 obj_11 obj_18)
       (pred_7 obj_11 obj_01)
       (pred_7 obj_11 obj_16)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_01 obj_02)
       (pred_7 obj_01 obj_17)
       (pred_7 obj_01 obj_11)
       (pred_7 obj_02 obj_12)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_02 obj_10)
       (pred_7 obj_02 obj_01)
       (pred_7 obj_03 obj_20)
       (pred_7 obj_03 obj_08)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_18 obj_07)
       (pred_7 obj_18 obj_11)
       (pred_7 obj_07 obj_12)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_07 obj_18)
       (pred_7 obj_12 obj_20)
       (pred_7 obj_12 obj_02)
       (pred_7 obj_12 obj_07)
       (pred_7 obj_20 obj_03)
       (pred_7 obj_20 obj_12)
       (pred_10 obj_08)
       (pred_10 obj_18)
       (pred_10 obj_10)
       (pred_12  obj_08 obj_13)
       (pred_12  obj_18 obj_09)
       (pred_12  obj_10 obj_13)
       (pred_6 obj_04)
       (pred_6 obj_19)
       (pred_6 obj_15)
       (pred_6 obj_21)
       (pred_6 obj_16)
       (pred_6 obj_17)
       (pred_6 obj_11)
       (pred_6 obj_01)
       (pred_6 obj_02)
       (pred_6 obj_03)
       (pred_6 obj_07)
       (pred_6 obj_12)
       (pred_6 obj_20)

       (pred_1  obj_06 obj_13)
       (pred_1  obj_14 obj_09)
       (pred_1  obj_05 obj_09)
       (pred_5 obj_06 obj_19)
       (pred_5 obj_14 obj_07)
       (pred_5 obj_05 obj_15)
       (pred_4 obj_21)
    )

    (:goal (and
       (pred_5 obj_14 obj_18)
       (pred_5 obj_05 obj_11)
    ))
(:constraints
  (always (not (pred_4 obj_17)))
)
)

; plan
1. (op_5 obj_21 obj_15)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_15)
   goals met: 0 of 2
2. (op_3 obj_15 obj_05)
   deleted: (pred_5 obj_05 obj_15) (pred_8)
   added: (pred_2 obj_05)
   goals met: 0 of 2
3. (op_5 obj_15 obj_19)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_19)
   goals met: 0 of 2
4. (op_5 obj_19 obj_04)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_04)
   goals met: 0 of 2
5. (op_5 obj_04 obj_16)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_16)
   goals met: 0 of 2
6. (op_5 obj_16 obj_11)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_11)
   goals met: 0 of 2
7. (op_5 obj_11 obj_01)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_01)
   goals met: 0 of 2
8. (op_5 obj_01 obj_07)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_07)
   goals met: 0 of 2
9. (op_2 obj_07 obj_18 obj_05 obj_09)
   deleted: (pred_10 obj_18)
   added: (pred_6 obj_18)
   goals met: 0 of 2
10. (op_4 obj_07 obj_14 obj_05)
   deleted: (pred_2 obj_05) (pred_5 obj_14 obj_07)
   added: (pred_2 obj_14) (pred_5 obj_05 obj_07)
   goals met: 0 of 2
11. (op_5 obj_07 obj_18)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_18)
   goals met: 0 of 2
12. (op_1 obj_18 obj_14)
   deleted: (pred_2 obj_14)
   added: (pred_8) (pred_5 obj_14 obj_18)
   goals met: 1 of 2
13. (op_5 obj_18 obj_07)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_07)
   goals met: 1 of 2
14. (op_3 obj_07 obj_05)
   deleted: (pred_5 obj_05 obj_07) (pred_8)
   added: (pred_2 obj_05)
   goals met: 1 of 2
15. (op_5 obj_07 obj_01)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_01)
   goals met: 1 of 2
16. (op_5 obj_01 obj_11)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_11)
   goals met: 1 of 2
17. (op_1 obj_11 obj_05)
   deleted: (pred_2 obj_05)
   added: (pred_8) (pred_5 obj_05 obj_11)
   goals met: 2 of 2
